#Дана строка 'rythm rough rush shake than’. Программа считает сколько букв ‘t’ в строке.

print("rythm rough rush shake than".count("t"))